In [1]:
import pandas as pd

## Series

In [2]:
lista = [1,2,3,4,5]

In [3]:
s = pd.Series(lista)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
nome_index = ['Linha_' + str(i) for i in range(5)]  # lista Linha_0 ...

In [6]:
nome_index

['Linha_0', 'Linha_1', 'Linha_2', 'Linha_3', 'Linha_4']

In [7]:
# Mudando o Series 's'
s = pd.Series(data=lista, index=nome_index)

In [8]:
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

In [9]:
# Criando essa Series com um dict
data = {'Linha_' + str(i) : i+1 for i in range(5)}

In [10]:
data

{'Linha_0': 1, 'Linha_1': 2, 'Linha_2': 3, 'Linha_3': 4, 'Linha_4': 5}

In [11]:
s = pd.Series(data)
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

In [12]:
# Operações com Series:

In [13]:
s2 = s + 2
s2

Linha_0    3
Linha_1    4
Linha_2    5
Linha_3    6
Linha_4    7
dtype: int64

In [14]:
s3 = s + s2
s3

Linha_0     4
Linha_1     6
Linha_2     8
Linha_3    10
Linha_4    12
dtype: int64

## DataFrame

In [15]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [16]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### Nomeando Linhas:

In [17]:
index = ['Linha_' + str(i) for i in range(3)]

In [18]:
df1 = pd.DataFrame(data, index=index)
df1

         0  1  2
Linha_0  1  2  3
Linha_1  4  5  6
Linha_2  7  8  9

#### Nomeando Colunas:

In [19]:
columns = ['Coluna_' + str(i) for i in range(3)]
columns

['Coluna_0', 'Coluna_1', 'Coluna_2']

In [20]:
df1 = pd.DataFrame(data, index=index, columns = columns)
df1

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

#### Com dicionário:

In [21]:
data = {'Coluna_0': {'Linha_0': 1, 'Linha_1': 4, 'Linha_2': 7},
        'Coluna_1': {'Linha_0': 2, 'Linha_1': 5, 'Linha_2': 8},
        'Coluna_2': {'Linha_0': 3, 'Linha_1': 6, 'Linha_2': 9}}
data

{'Coluna_0': {'Linha_0': 1, 'Linha_1': 4, 'Linha_2': 7},
 'Coluna_1': {'Linha_0': 2, 'Linha_1': 5, 'Linha_2': 8},
 'Coluna_2': {'Linha_0': 3, 'Linha_1': 6, 'Linha_2': 9}}

In [22]:
df2 = pd.DataFrame(data)
df2

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

#### Com tuplas:

In [23]:
data = [(1,2,3), (4,5,6), (7,8,9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [24]:
df3 = pd.DataFrame(data, index=index, columns = columns)
df3

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

### Concatenar DataFrames:

In [25]:
df1[df1 > 0] = 'A' # todso que forem maiores que 0, passarão a ser "A"
df1

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A

In [28]:
df2[df2 > 0] = 'B'
df2

        Coluna_0 Coluna_1 Coluna_2
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B

In [29]:
df3[df3 > 0] = 'C'
df3

        Coluna_0 Coluna_1 Coluna_2
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

In [35]:
# Concatenando usando colunas
df4 = pd.concat([df1, df2, df3])
df4

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

In [36]:
# Concatenando usando linhas
df4 = pd.concat([df1, df2, df3], axis=1) # axis=1 (DataFrame[1] são as linhas)
df4

,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2
Linha_0,A,A,A,B,B,B,C,C,C
Linha_1,A,A,A,B,B,B,C,C,C
Linha_2,A,A,A,B,B,B,C,C,C